MikroElektronika/HEXIWEAR/SW/KW40/HEXIWEAR_bluetooth/common/app.c
#if gBondingSupported_d
static bleDeviceAddress_t   maPeerDeviceAddress;
static uint8_t mcBondedDevices = 0;
static bleAddressType_t     mPeerDeviceAddressType;
static uint32_t smpPasskey = 0;
#endif

typedef enum 
{
    kGpioHostWakeup = GPIO_MAKE_PIN(GPIOB_IDX, 0),   
    kGpioHostInt = GPIO_MAKE_PIN(GPIOB_IDX, 18),   
}
bleApp_pins;

static gpio_input_pin_t bleApp_wakeUpPin = 
{
    .isPullEnable = false,
    .pullSelect = kPortPullUp,
    .isPassiveFilterEnabled = false,
    .interrupt = kPortIntEitherEdge,
};

static gpio_input_pin_user_config_t bleApp_intPin =
{
    .pinName = kGpioHostInt,
    .config.isPullEnable = false,
    .config.pullSelect = kPortPullDown,
    .config.isPassiveFilterEnabled = false,
    .config.interrupt = kPortIntLogicZero,
};

/* Service Data*/

static basConfig_t      basServiceConfig = {service_battery, 100};
static disConfig_t      disServiceConfig = {service_device_info};
static otapClientConfig_t otapServiceConfig = {service_otap};
static uint16_t otapWriteNotifHandles[] = {value_otap_control_point,
                                           value_otap_data};

static uint16_t writeNotifHandles[]      = {value_alertIn};

/* Application specific data*/
static bool_t mContactStatus = TRUE;

extern uint8_t gAppSerMgrIf;

static tmrTimerID_t goToSleepTimerId;

static bool_t sleepFalg = false;

/*! OTAP Client data structure.
 *  Contains current image information and state informations
 *  regarding the image download procedure. */
static otapClientAppData_t     otapClientData = 
{
    .state = mOtapClientStateIdle_c,
    .currentImgId = {0x00, 0x00},          // Current Running Image Id - should be 0x0000
    .currentImgVer = {0x01, 0x00, 0x00,    // Build Version
                      0x41,                // Stack Version
                      0x11, 0x11, 0x11,    // Hardware Id
                      0x01                 // Manufacturer Id
                     },                    // Current Image Version
    .peerOtapServer = gInvalidDeviceId_c,
    .imgId = {0x00, 0x00},
    .imgVer = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00},
    .imgSize = 0,
    .imgComputedCrc = 0,
    .imgReceivedCrc = 0,
    .imgSectorBitmap = {0x00},
    .currentPos = 0,
    .chunkSize = 0,
    .chunkSeqNum = 0,
    .totalBlockChunks = 0,
    .totalBlockSize = 0,
    .transferMethod = gOtapTransferMethodAtt_c,   // The default transfer method is ATT
    .l2capChannelOrPsm = gL2capCidAtt_c,   // The default L2CAP channel is the ATT Channel
    .lastCmdSentToOtapServer = gOtapCmdIdNoCommand_c,
};

static const uint8_t imageIdAll[gOtap_ImageIdFieldSize_c] = {0x00, 0x00};
static const uint8_t imageIdKW40[gOtap_ImageIdFieldSize_c] = {0x01, 0x00};
static const uint8_t imageIdMK64[gOtap_ImageIdFieldSize_c] = {0x02, 0x00};

uint8_t currentImageVerMK64[gOtap_ImageVersionFieldSize_c] = 
{
    0x01, 0x00, 0x00,    // Build Version
    0x41,                // Stack Version
    0x11, 0x11, 0x11,    // Hardware Id
    0x01                 // Manufacturer Id
};

uint8_t currentImageVerKW40[gOtap_ImageVersionFieldSize_c] = 
{
    0x01, 0x00, 0x00,    // Build Version
    0x41,                // Stack Version
    0x11, 0x11, 0x11,    // Hardware Id
    0x01                 // Manufacturer Id
};

/************************************************************************************
*************************************************************************************
* Private functions prototypes
*************************************************************************************
************************************************************************************/

/* Gatt and Att callbacks */
static void BleApp_AdvertisingCallback (gapAdvertisingEvent_t* pAdvertisingEvent);
static void BleApp_ConnectionCallback (deviceId_t peerDeviceId, gapConnectionEvent_t* pConnectionEvent);
static void BleApp_Config();
static void BleApp_GattServerCallback (deviceId_t deviceId, gattServerEvent_t* pServerEvent);

static void BleApp_CccdWritten (deviceId_t deviceId, uint16_t handle, gattCccdFlags_t cccd);
static void BleApp_AttributeWritten(deviceId_t deviceId, uint16_t handle, uint16_t length, uint8_t *pValue);
static void BleApp_AttributeWrittenWithoutResponse (deviceId_t deviceId, uint16_t handle, uint16_t length, uint8_t* pValue);
static void BleApp_HandleValueConfirmation (deviceId_t deviceId);
static void BatteryMeasurementTimerCallback (void *);
static void BleApp_AddToWhiteList(void);

/* Timer Callbacks */
static void TimerMeasurementCallback (void *);

static void BleApp_Advertise(void);

static void Ble_StartServices(void);

/* OTAP Client functions */
/* Commands received from the OTAP Server */
static void OtapClient_HandleDataChunk (deviceId_t deviceId, uint16_t length, uint8_t* pData);
static void OtapClient_HandleNewImageNotification (deviceId_t deviceId, uint16_t length, uint8_t* pValue);
static void OtapClient_HandleNewImageInfoResponse (deviceId_t deviceId, uint16_t length, uint8_t* pValue);
static void OtapClient_HandleErrorNotification (deviceId_t deviceId, uint16_t length, uint8_t* pValue);
/* Confirmations of commands sent to the OTAP Server */
static void OtapClient_HandleNewImageInfoRequestConfirmation (deviceId_t deviceId);
static void OtapClient_HandleImageBlockRequestConfirmation (deviceId_t deviceId);
static void OtapClient_HandleImageTransferCompleteConfirmation (deviceId_t deviceId);
static void OtapClient_HandleErrorNotificationConfirmation (deviceId_t deviceId);
static void OtapClient_HandleStopImageTransferConfirmation (deviceId_t deviceId);
/* Connection and Disconnection events */
static void OtapClient_HandleConnectionEvent (deviceId_t deviceId);
static void OtapClient_HandleDisconnectionEvent (deviceId_t deviceId);
/* Otap Client operations */
static void OtapClient_ContinueImageDownload (deviceId_t deviceId);
static bool_t OtapClient_IsRemoteImageNewer (uint8_t* pRemoteImgId, uint8_t* pRemoteImgVer);
static bool_t OtapClient_CheckRemoteID(uint8_t* pRemoteImgId);
static otapStatus_t OtapClient_IsImageFileHeaderValid (bleOtaImageFileHeader_t* imgFileHeader);

static void OtapClient_Complete(void);
static void OtapClient_Fail(void);

static void BleApp_L2caControlCallback(l2capControlMessageType_t  messageType, void* pMessage);
static void BleApp_LowPowerEnterCallback(void);
static void BleApp_SendConnUpdateReq(deviceId_t peerDeviceId);

