MikroElektronika/HEXIWEAR/SW/KW40/HEXIWEAR_bluetooth/common/app.c
/* Timer Callbacks */
static void BleApp_GoToSleepTimerCallback (void *);

/************************************************************************************
*************************************************************************************
* Public functions
*************************************************************************************
************************************************************************************/

/*! *********************************************************************************
* \brief    
*
********************************************************************************** */

void BleApp_AdvDisable(void)
{
    // Get device parameters from FLASH.
    NV_ReadHWParameters(&gHardwareParameters);
    gHardwareParameters.advMode = (uint8_t) advMode_disable;
    NV_WriteHWParameters(&gHardwareParameters);
    ResetMCU();
}

/*! *********************************************************************************
* \brief    
*
********************************************************************************** */

void BleApp_AdvEnable(void)
{   
    // Get device parameters from FLASH.
    NV_ReadHWParameters(&gHardwareParameters);
    gHardwareParameters.advMode = (uint8_t) advMode_enable;
    NV_WriteHWParameters(&gHardwareParameters);
    ResetMCU();
}

/*! *********************************************************************************
* \brief    
*
********************************************************************************** */

advMode_t BleApp_GetAdvMode(void)
{
    return advMode;
}

/*! *********************************************************************************
* \brief    
*
********************************************************************************** */

linkState_t BleApp_GetLinkState(void)
{
    return ((mPeerDeviceId == gInvalidDeviceId_c) ? linkState_disconnected : linkState_connected);
}

/*! *********************************************************************************
* \brief    
*
********************************************************************************** */

static bool BleApp_VerifyFlashRead(uint8_t * data, uint16_t size)
{
    for(uint16_t cnt = 0; cnt < size; cnt++)
    {
        if(data[cnt] != 0xFF)   
        {
            return true;
        }
    }
    
    return false;
}

/*! *********************************************************************************
* \brief    
*
********************************************************************************** */

static void BleApp_ReadFwImagProps(void)
{
    uint8_t *imgId;
    uint8_t *imgVer;
    
    // Read image version.
    if(BleApp_VerifyFlashRead((uint8_t *)gHardwareParameters.imageVersionMK64, gOtap_ImageVersionFieldSize_c) == true)
    {
        // Read image version from FLASH.
        FLib_MemCpy((uint8_t *) currentImageVerMK64, (uint8_t *) gHardwareParameters.imageVersionMK64, gOtap_ImageVersionFieldSize_c);
    }
    if(BleApp_VerifyFlashRead((uint8_t *)gHardwareParameters.imageVersionKW40, gOtap_ImageVersionFieldSize_c) == true)
    {
        // Read image version from FLASH.
        FLib_MemCpy((uint8_t *) currentImageVerKW40, (uint8_t *) gHardwareParameters.imageVersionKW40, gOtap_ImageVersionFieldSize_c);
    }
    
    if(deviceState != deviceState_watch)
    {
        if(deviceState == deviceState_otapStartedMK64)
        {
            imgId  = (uint8_t *)imageIdMK64;
            imgVer = (uint8_t *)currentImageVerMK64;
        }
        else if(deviceState == deviceState_otapStartedKW40)
        {
            imgId  = (uint8_t *)imageIdKW40;
            imgVer = (uint8_t *)currentImageVerKW40;
        }
        
        // Set current image id base on current device state.
        FLib_MemCpy((uint8_t *) otapClientData.currentImgId, (uint8_t *) imgId, gOtap_ImageIdFieldSize_c);
        
        // Set current image version.
        FLib_MemCpy((uint8_t *) otapClientData.currentImgVer, (uint8_t *) imgVer, gOtap_ImageVersionFieldSize_c);
    }
}

/*! *********************************************************************************
* \brief    Initializes application specific functionality before the BLE stack init.
*
********************************************************************************** */

void BleApp_Init(void)
{
    hostInterface_packet_t hostInterface_packet = 
    {
        .length  = 0,
        .data[0] = gHostInterface_trailerByte,
    };
    
    // Get device parameters from FLASH.
    NV_ReadHWParameters(&gHardwareParameters);
    
    // Check if there is valid device state written into FLASH.
    if(BleApp_VerifyFlashRead((uint8_t *)&gHardwareParameters.deviceState, 1) == true)
    {
        // Get state written into FLASH.
        deviceState = (deviceState_t)gHardwareParameters.deviceState;
    }
    else
    {
        // Default state is "deviceState_watch".
        deviceState = deviceState_watch;
    }
    
        
    // If device state is "deviceState_otapCompleted" or "deviceState_otapFailed",
    // set corresponding packet which will be sent through Host Interface and go to "deviceState_watch".
    if(deviceState == deviceState_otapCompleted)
    {
        hostInterface_packet.type = packetType_otapCompleted;
        deviceState = deviceState_watch;
    }
    else if(deviceState == deviceState_otapFailed)
    {
        hostInterface_packet.type = packetType_otapFailed;
        deviceState = deviceState_watch;
    }
   
        
    // Host interface should be active only in "deviceState_watch" state.
    if(deviceState == deviceState_watch)
    {
        HostInterface_Init();
    }
    
    
    // If device state was changed, update it on FLASH, and send 
    // corresponding packet to the host mcu (as information that OTAP was success or fail)
    if(gHardwareParameters.deviceState != deviceState)
    {
        gHardwareParameters.deviceState = (uint8_t) deviceState_watch;
        NV_WriteHWParameters(&gHardwareParameters);
        while(HostInterface_TxQueueMsgPut((hostInterface_packet_t *)&hostInterface_packet, true) != osaStatus_Success)
        {
            OSA_TimeDelay(10);
        }
    }
    // If this condition met device is in some of "otapStart" modes.
    // Write "otapFailed" state to FLASH to "protect" from unregular reset.
    // If otap success this state will be overwritten.
    else if(deviceState != deviceState_watch)
    {
        gHardwareParameters.deviceState = (uint8_t) deviceState_otapFailed;
        NV_WriteHWParameters(&gHardwareParameters);
    }
    
