MikroElektronika/HEXIWEAR/SW/KW40/HEXIWEAR_bluetooth/common/app.c
    // TSI should be active only in "deviceState_watch" state.
    if(deviceState == deviceState_watch)
    {
        TouchSense_Init();
    }
    
    BleApp_ReadFwImagProps();
    
    // Check if there is valid advertise mode written into FLASH.
    if(BleApp_VerifyFlashRead((uint8_t *)&gHardwareParameters.advMode, 1) == true)
    {
        // Get mode written into FLASH.
        advMode = (advMode_t)gHardwareParameters.advMode;
    }
    else
    {
        // Default mode is "advMode_enable".
        advMode = advMode_enable;
    }
    asm("nop");
}

/*! *********************************************************************************
* \brief    Starts the BLE application.
*
********************************************************************************** */

void BleApp_Start(void)
{
    if(advMode == advMode_disable)
    {
        return;
    }
    else
    {
    #if gBondingSupported_d
        if (mcBondedDevices > 0)
        {
            mAdvState.advType = fastWhiteListAdvState_c;
        }
        else
        {
    #endif
            mAdvState.advType = fastAdvState_c;
    #if gBondingSupported_d
        }
    #endif

        BleApp_Advertise();
    #if (cPWR_UsePowerDownMode)    
//        PWR_ChangeDeepSleepMode(1);
//        PWR_AllowDeviceToSleep();    
    #endif           
    }
}

/*! *********************************************************************************
* \brief        Handles BLE generic callback.
*
* \param[in]    pGenericEvent    Pointer to gapGenericEvent_t.
********************************************************************************** */

void BleApp_GenericCallback (gapGenericEvent_t* pGenericEvent)
{
    switch (pGenericEvent->eventType)
    {
        case gInitializationComplete_c:
        {
            DebugPrint("InitializationComplete");
            
            BleApp_Config();
            BleApp_Start();
        }
        break;    
            
        case gRandomAddressReady_c :
        {
        #if gBondingSupported_d
            /* Use address read from the controller */
            FLib_MemCpyReverseOrder(maBleDeviceAddress, pGenericEvent->eventData.aAddress, sizeof(bleDeviceAddress_t));
            Gap_SetRandomAddress(maBleDeviceAddress);
        #endif
        }
        break;
        
        case gRandomAddressSet_c:
        {
        #if gBondingSupported_d
            /* Use address read from the controller */
            smpKeys.aAddress = maBleDeviceAddress;
        #endif
        }
        break;
        
        case gPublicAddressRead_c:
        {
            /* Use address read from the controller */
            FLib_MemCpyReverseOrder(maBleDeviceAddress, pGenericEvent->eventData.aAddress, sizeof(bleDeviceAddress_t));
        }
        break;            
         
        
        case gWhiteListCleared_c:
        {
            ;
        }
        break;

        case gAdvertisingDataSetupComplete_c:
        {            
            ;
        }
        break;  
        
        case gAdvertisingParametersSetupComplete_c:
        {
            App_StartAdvertising(BleApp_AdvertisingCallback, BleApp_ConnectionCallback);
        }
        break;         

        case gInternalError_c:
        {
            DebugPrint("GenericCallbackInternalError !!!!!");
            ResetMCU();
            panic(0,0,0,0);
        }
        break;

        default: 
            break;
    }
}

/************************************************************************************
*************************************************************************************
* Private functions
*************************************************************************************
************************************************************************************/


static void Ble_StartServices(void)
{
    /* Start services */
    if(deviceState == deviceState_watch)
    {
        Bas_Start(&basServiceConfig);
        Dis_Start(&disServiceConfig);
        Mos_Start();
        Wes_Start();
        Hes_Start();
        Als_Start();
    }
    else
    {
        OtapCS_Start(&otapServiceConfig);
    }
}


static void Ble_Subscribe(deviceId_t deviceId)
{
    if(deviceState == deviceState_watch)
    {
        Bas_Subscribe(deviceId);
        Mos_Subscribe(deviceId);
        Wes_Subscribe(deviceId);
        Hes_Subscribe(deviceId);
        Als_Subscribe(deviceId);
    }
    else
    {
        OtapCS_Subscribe(deviceId);
    }
}


static void Ble_Unsubscribe(void)
{
    if(deviceState == deviceState_watch)
    {
        Bas_Unsubscribe();
        Mos_Unsubscribe();
        Wes_Unsubscribe();
        Hes_Unsubscribe();
        Als_Unsubscribe();
    }
    else
    {
        OtapCS_Unsubscribe();
    }
}

static void BleApp_AddToWhiteList(void)
{
#if gBondingSupported_d    
    bleDeviceAddress_t aBondedDevAdds[gcGapMaximumBondedDevices_d];
      
    bleResult_t result = Gap_GetBondedStaticAddresses(aBondedDevAdds, gcGapMaximumBondedDevices_d, &mcBondedDevices);
    
    if (gBleSuccess_c == result && mcBondedDevices > 0)
    {
        for (uint8_t i = 0; i < mcBondedDevices; i++)
        {
            Gap_AddDeviceToWhiteList(gBleAddrTypePublic_c, aBondedDevAdds[i]);
        }
    }
#endif    
}

/*! *********************************************************************************
* \brief        Configures BLE Stack after initialization. Usually used for
*               configuring advertising, scanning, white list, services, et al.
*
********************************************************************************** */

static void BleApp_Config()
{  
    uint8_t uniqueID[10];
    uint8_t fwRevision[12] = "1.0.0/1.0.0";
    uint16_t gpioPin;
    
    // Read unique ID
    FLib_MemCpy(uniqueID, (uint8_t *)&SIM_BASE_PTR->UIDL, 4);
    FLib_MemCpy(uniqueID + 4, (uint8_t *)&SIM_BASE_PTR->UIDML, 4);
    FLib_MemCpy(uniqueID + 8, (uint8_t *)&SIM_BASE_PTR->UIDMH, 2);
    
    // Read public static address
    Gap_ReadPublicDeviceAddress();
    
    /* Register for callbacks*/
    
    // Register server callback
    App_RegisterGattServerCallback(BleApp_GattServerCallback);
    
    // Register client callback
    App_RegisterGattClientProcedureCallback(ClientAncs_GattCallback);
    App_RegisterGattClientNotificationCallback(ClientAncs_GattNotificationCallback);
    
