MikroElektronika/HEXIWEAR/SW/KW40/HEXIWEAR_bluetooth/common/app.c
    //App_RegisterL2caControlCallback(BleApp_L2caControlCallback);
    
    if(deviceState == deviceState_watch)
    {
        GattServer_RegisterHandlesForWriteNotifications (sizeof(writeNotifHandles)/sizeof(writeNotifHandles[0]),
                                                         writeNotifHandles);
    }
    else
    {
        GattServer_RegisterHandlesForWriteNotifications (sizeof(otapWriteNotifHandles)/sizeof(otapWriteNotifHandles[0]),
                                                         otapWriteNotifHandles);
    }
        
    /* Register security requirements */
#if gUseServiceSecurity_d
    //Gap_RegisterDeviceSecurityRequirements(&deviceSecurityRequirements);
#endif

    /* Set local passkey */
#if gBondingSupported_d
    
#endif
    

    /* Setup Advertising and scanning data */
    if(deviceState == deviceState_watch)
    {
        gAppAdvertisingData.cNumAdStructures = 2;
        gAppAdvertisingData.aAdStructures = (void *)advScanStruct_watch;
    }
    else
    {
        gAppAdvertisingData.cNumAdStructures = 3;
        gAppAdvertisingData.aAdStructures = (void *)advScanStruct_otap;
    }
    
    Gap_SetAdvertisingData(&gAppAdvertisingData, &gAppScanRspData);

    /* Add to White List if bonding is supported */
#if gBondingSupported_d
    uint8_t bondedDeviceCnt;
    
    Gap_GetBondedDevicesCount(&bondedDeviceCnt);
    if(bondedDeviceCnt > (gcGapMaximumBondedDevices_d - 1))
    {
        while(Gap_RemoveBond(0) != gBleSuccess_c )
        {
            OSA_TimeDelay(10);
        }
    }

    BleApp_AddToWhiteList();
#endif

    mAdvState.advOn = FALSE;
    clientAncsPeerInfo.appState = mAppIdle_c;

    Ble_StartServices();
    
    // Populate values of Device Service Characteristics with proper values.
    fwRevision[0] = currentImageVerMK64[0] + '0';
    fwRevision[2] = currentImageVerMK64[1] + '0';
    fwRevision[4] = currentImageVerMK64[2] + '0';
    fwRevision[6]  = currentImageVerKW40[0] + '0';
    fwRevision[8]  = currentImageVerKW40[1] + '0';
    fwRevision[10] = currentImageVerKW40[2] + '0';
    GattDb_WriteAttribute(value_fw_rev, 11, fwRevision);
    GattDb_WriteAttribute(value_serial_num, 10, uniqueID);
    
    // Write current state to corresponding characteristic.
    GattDb_WriteAttribute(value_otap_state, 1, (uint8_t *)&deviceState);

    goToSleepTimerId = TMR_AllocateTimer();
    
#if (cPWR_UsePowerDownMode)    
    if(deviceState == deviceState_watch)
    {
        // Initializes GPIO pins. 
        GPIO_DRV_InputPinInit(&bleApp_intPin);
        
        PWR_ChangeDeepSleepMode(1); /* MCU=LLS3, LL=IDLE, wakeup on GPIO/LL */
        POWER_SYS_SetWakeupPin(kPowerManagerWakeupPin8, kLlwuExternalPinChangeDetect, &bleApp_wakeUpPin);
    }
    else
    {
        bleApp_intPin.config.interrupt = kPortIntDisabled;
        GPIO_DRV_InputPinInit(&bleApp_intPin);
    }
#else
    bleApp_intPin.config.interrupt = kPortIntDisabled;
    GPIO_DRV_InputPinInit(&bleApp_intPin);
#endif        
    
}

/*! *********************************************************************************
* \brief        Configures GAP Advertise parameters. Advertise will satrt after
*               the parameters are set.
*
********************************************************************************** */

static void BleApp_Advertise(void)
{

    advParams.minInterval = gFastConnMinAdvInterval_c;
    advParams.maxInterval = gFastConnMaxAdvInterval_c;
    advParams.filterPolicy = gProcessAll_c;
            
    advParams.ownAddressType = gBleAddrTypePublic_c;
    
    /* Set advertising parameters */
    Gap_SetAdvertisingParameters(&advParams);
}

/*! *********************************************************************************
* \brief        
*
********************************************************************************** */

static void BleApp_L2caControlCallback(l2capControlMessageType_t  messageType, void* pMessage)
{
    if (messageType == gL2ca_ConnectionParameterUpdateComplete_c)
    {
        asm("nop");
    }
}        

/*! *********************************************************************************
* \brief        
*
********************************************************************************** */

static void BleApp_SendConnUpdateReq(deviceId_t peerDeviceId)
{
    if(deviceState == deviceState_watch)
    {
        L2ca_UpdateConnectionParameters(peerDeviceId, gWatchConnMinInterval_c, gWatchConnMaxInterval_c,
                                                        gConnSlaveLatency_c, gConnTimeoutMultiplier_c, 0, 0);
    }
    else
    {
        L2ca_UpdateConnectionParameters(peerDeviceId, gOtapConnMinInterval_c, gOtapConnMaxInterval_c,
                                                        gConnSlaveLatency_c, gConnTimeoutMultiplier_c, 0, 0);
    }
}
        
/*! *********************************************************************************
* \brief        Handles BLE Advertising callback from host stack.
*
* \param[in]    pAdvertisingEvent    Pointer to gapAdvertisingEvent_t.
********************************************************************************** */

static void BleApp_AdvertisingCallback (gapAdvertisingEvent_t* pAdvertisingEvent)
{
    switch (pAdvertisingEvent->eventType)
    {
        case gAdvertisingStateChanged_c:
        {
            
            mAdvState.advOn = !mAdvState.advOn;
            
            #if (cPWR_UsePowerDownMode)
                if(!mAdvState.advOn)
                {
                    Led1Off();
                    //PWR_ChangeDeepSleepMode(1);
                    //PWR_AllowDeviceToSleep();    
                }  
                else
                {
                    //PWR_ChangeDeepSleepMode(1);
                    Led1On();
                }
            #else 
                LED_StopFlashingAllLeds();
                Led1Flashing();
                if(!mAdvState.advOn)
                {
                    DebugPrint("AdvertisingStop");
                    Led2Flashing();
                    Led3Flashing();
                    Led4Flashing();
                }
                else 
                {
                    DebugPrint("AdvertisingStart");
                }
            #endif
        }
        break;

