MikroElektronika/HEXIWEAR/SW/KW40/HEXIWEAR_bluetooth/common/app.c
        case gAdvertisingCommandFailed_c:
        {
            DebugPrint("AdvertisingCommandFailed !!!!!");
            
            panic(0,0,0,0);
        }
        break;

        default:
            break;
    }
}

/*! *********************************************************************************
* \brief        Handles BLE Connection callback from host stack.
*
* \param[in]    peerDeviceId        Peer device ID.
* \param[in]    pConnectionEvent    Pointer to gapConnectionEvent_t.
********************************************************************************** */

static void BleApp_ConnectionCallback (deviceId_t peerDeviceId, gapConnectionEvent_t* pConnectionEvent)
{
    bleResult_t result;    
    switch (pConnectionEvent->eventType)
    {
        case gConnEvtConnected_c:
        {
            DebugPrint("ConnEvtConnected");
            
            #if gBondingSupported_d    
                /* Copy peer device address information */
                mPeerDeviceAddressType = pConnectionEvent->eventData.connectedEvent.peerAddressType;
                FLib_MemCpy(maPeerDeviceAddress, pConnectionEvent->eventData.connectedEvent.peerAddress, sizeof(bleDeviceAddress_t));
            #endif  
            
            /* Advertising stops when connected */
            mAdvState.advOn = FALSE;
            mPeerDeviceId = peerDeviceId;
            
            clientAncsPeerInfo.deviceId = peerDeviceId;
            clientAncsPeerInfo.isBonded = FALSE; 
            
            if(advMode == advMode_disable)
            {
                Gap_Disconnect(peerDeviceId);
            }
            else
            {
                /* Subscribe client*/
                Ble_Subscribe(peerDeviceId);
                
                #if gUseServiceSecurity_d            
                {
                    bool_t isBonded = FALSE;
                    if (gBleSuccess_c == Gap_CheckIfBonded(peerDeviceId, &isBonded) &&
                        FALSE == isBonded)
                    {
                        // Remote device should be bonded before try to do OTAP.
                        if(deviceState == deviceState_watch)
                        {
                            Gap_SendSlaveSecurityRequest(peerDeviceId, gBondingSupported_d, gSecurityMode_1_Level_3_c);
                        }
                        else
                        {
                            OtapClient_Fail();
                            ResetMCU();
                        }
                    }
                }
                #endif            

                /* UI */
                LED_StopFlashingAllLeds();
                Led1On();
                
                if(deviceState != deviceState_watch)
                {
                    /* Device does not need to sleep until some information is exchanged with the peer. */
                #if (cPWR_UsePowerDownMode)    
                    PWR_DisallowDeviceToSleep();
                #endif
                    OtapClient_HandleConnectionEvent (peerDeviceId);
                }
                else
                {
                    hostInterface_packet_t hostInterface_packet = 
                    {
                        .type    = packetType_linkStateSend,
                        .length  = 1,
                        .data[0] = linkState_connected,
                        .data[1] = gHostInterface_trailerByte,
                    };
                    while(HostInterface_TxQueueMsgPut((hostInterface_packet_t *)&hostInterface_packet, true) != osaStatus_Success)
                    {
                        OSA_TimeDelay(10);
                    }
                    ClientAncs_StateMachineHandler(clientAncsPeerInfo.deviceId, mAppEvt_PeerConnected_c);
                }
            }
            #if (cPWR_UsePowerDownMode)             
//            PWR_ChangeDeepSleepMode(1);
//            PWR_AllowDeviceToSleep();
            #endif
        }
        break;
        
        case gConnEvtDisconnected_c:
        {
            uint8_t bondedDeviceCnt;
            DebugPrint("ConnEvtDisconnected");
            
        #if gBondingSupported_d
            Gap_GetBondedDevicesCount(&bondedDeviceCnt);
            if(bondedDeviceCnt > (gcGapMaximumBondedDevices_d - 1))
            {
                while(Gap_RemoveBond(0) != gBleSuccess_c )
                {
                    OSA_TimeDelay(10);
                }
            }
        #endif
            
            if(deviceState != deviceState_watch)
            {
                OtapClient_Fail();
                ResetMCU();
            }
            else
            {
                hostInterface_packet_t hostInterface_packet = 
                {
                    .type    = packetType_linkStateSend,
                    .length  = 1,
                    .data[0] = linkState_disconnected,
                    .data[1] = gHostInterface_trailerByte,
                };
                while(HostInterface_TxQueueMsgPut((hostInterface_packet_t *)&hostInterface_packet, true) != osaStatus_Success)
                {
                    OSA_TimeDelay(10);
                }
            }
            
            /* Unsubscribe client */
            Ble_Unsubscribe();

            mPeerDeviceId = gInvalidDeviceId_c;
            clientAncsPeerInfo.deviceId = gInvalidDeviceId_c;
            
            /* Reset Service Discovery to be sure*/
            ClientAncs_ServiceDiscoveryErrorHandler();
            
            if(advMode == advMode_disable)
            {
                ;
            }
            else if (pConnectionEvent->eventData.disconnectedEvent.reason == gHciConnectionTimeout_c)
            {
                /* Link loss detected*/
                BleApp_Start();
            }
            else
            {
                /* Connection was terminated by peer or application */
                BleApp_Start();
            }
        }
        break;

#if gBondingSupported_d
        
       case gConnEvtAuthenticationRejected_c:
       {
           Gap_RejectPairing(peerDeviceId, gLinkEncryptionFailed_c);
           break;
       }
               
        
        case gConnEvtEncryptionChanged_c:
        {       
            ClientAncs_StateMachineHandler(clientAncsPeerInfo.deviceId, mAppEvt_EncryptionChg_c);
            BleApp_SendConnUpdateReq(peerDeviceId);
            break;
        }
        
