MikroElektronika/HEXIWEAR/SW/KW40/HEXIWEAR_bluetooth/common/app.c
        case gConnEvtKeysReceived_c:
        {
            DebugPrint("ConnEvtKeysReceived");    
            
            /* Copy peer device address information when IRK is used */
            if (pConnectionEvent->eventData.keysReceivedEvent.pKeys->aIrk != NULL)
            {
                mPeerDeviceAddressType = pConnectionEvent->eventData.keysReceivedEvent.pKeys->addressType;
                FLib_MemCpy(maPeerDeviceAddress, pConnectionEvent->eventData.keysReceivedEvent.pKeys->aAddress, sizeof(bleDeviceAddress_t));
            }
        }
        break;

        case gConnEvtPasskeyDisplay_c:
        {
            hostInterface_packet_t hostInterface_packet = 
            {
                .type   = packetType_passDisplay,
                .length = 3,
                .data[3] = gHostInterface_trailerByte
            };

            FLib_MemCpy(hostInterface_packet.data, &smpPasskey, 3);
            while(HostInterface_TxQueueMsgPut((hostInterface_packet_t *)&hostInterface_packet, true) != osaStatus_Success)
            {
                OSA_TimeDelay(10);
            }
        }
        break;
            
        case gConnEvtPairingComplete_c:
        {
            DebugPrint("ConnEvtPairingComplete");    
            
            if (pConnectionEvent->eventData.pairingCompleteEvent.pairingSuccessful &&
                pConnectionEvent->eventData.pairingCompleteEvent.pairingCompleteData.withBonding)
            {
                /* If a bond is created, write device address in controller’s White List */
                Gap_AddDeviceToWhiteList(mPeerDeviceAddressType, maPeerDeviceAddress);
                ClientAncs_StateMachineHandler(clientAncsPeerInfo.deviceId, mAppEvt_PairingComplete_c);
                BleApp_SendConnUpdateReq(peerDeviceId);
            }
            else
            {
                Gap_Disconnect (peerDeviceId);
            }
        }
        break; 

        case gConnEvtPairingRequest_c:
        {
            if(deviceState == deviceState_watch)
            {
                DebugPrint("ConnEvtPairingRequest");
                
                //Get random passkey
                RNG_GetRandomNo(&smpPasskey);
                
                // Scale it to (100000 - 999999) range
                smpPasskey = (smpPasskey % 900000);
                smpPasskey += 100000;    
                
                // Set as loacal passkey
                Gap_SetLocalPasskey(smpPasskey);
                
                // Accept Pairing Request
                gPairingParameters.centralKeys = pConnectionEvent->eventData.pairingEvent.centralKeys;
                Gap_AcceptPairingRequest(peerDeviceId, &gPairingParameters);
            }
            else
            {
                OtapClient_Fail();
                ResetMCU();
            }
        }    
        break;
        
        case gConnEvtKeyExchangeRequest_c:
        {
            DebugPrint("ConnEvtKeyExchangeRequest");
            
            gapSmpKeys_t sentSmpKeys = smpKeys;
                    
            if (!(pConnectionEvent->eventData.keyExchangeRequestEvent.requestedKeys & gLtk_c))
            {
                sentSmpKeys.aLtk = NULL;
                /* When the LTK is NULL EDIV and Rand are not sent and will be ignored. */
            }
            
            if (!(pConnectionEvent->eventData.keyExchangeRequestEvent.requestedKeys & gIrk_c))
            {
                sentSmpKeys.aIrk = NULL;
                /* When the IRK is NULL the Address and Address Type are not sent and will be ignored. */
            }
            
            if (!(pConnectionEvent->eventData.keyExchangeRequestEvent.requestedKeys & gCsrk_c))
            {
                sentSmpKeys.aCsrk = NULL;
            }
            
            Gap_SendSmpKeys(peerDeviceId, &sentSmpKeys);
        }
        break;
            
        case gConnEvtLongTermKeyRequest_c:
        {
            bool_t isBonded = FALSE;
               
            DebugPrint("ConnEvtLongTermKeyRequest");
           
            if (gBleSuccess_c == Gap_CheckIfBonded(peerDeviceId, &isBonded) &&
                FALSE == isBonded)
            {
                Gap_DenyLongTermKey(peerDeviceId);
            }
            else if (pConnectionEvent->eventData.longTermKeyRequestEvent.ediv == smpKeys.ediv &&
                pConnectionEvent->eventData.longTermKeyRequestEvent.randSize == smpKeys.cRandSize)
            {
                /* EDIV and RAND both matched */
                Gap_ProvideLongTermKey(peerDeviceId, smpKeys.aLtk, smpKeys.cLtkSize);
            }
            else
            /* EDIV or RAND size did not match */
            {
                Gap_DenyLongTermKey(peerDeviceId);
            }
        }
        break;
#else
        case gConnEvtPairingRequest_c:
        {
            Gap_RejectPairing (peerDeviceId, gPairingNotSupported_c);
        }    
        break;
#endif
               
    default:
        break;
    }
}

/*! *********************************************************************************
* \brief        Handles GATT server callback from host stack.
*
* \param[in]    deviceId        Peer device ID.
* \param[in]    pServerEvent    Pointer to gattServerEvent_t.
********************************************************************************** */
static void BleApp_GattServerCallback (deviceId_t deviceId, gattServerEvent_t* pServerEvent)
{
    uint16_t handle;
    uint8_t status;
    
    switch (pServerEvent->eventType)
    {
        case gEvtCharacteristicCccdWritten_c:
        {
            Gap_SaveCccd (deviceId,
                          pServerEvent->eventData.charCccdWrittenEvent.handle,
                          pServerEvent->eventData.charCccdWrittenEvent.newCccd);
            
            BleApp_CccdWritten (deviceId,
                                pServerEvent->eventData.charCccdWrittenEvent.handle,
                                pServerEvent->eventData.charCccdWrittenEvent.newCccd) ;
        }
        break;
        
        case gEvtAttributeWritten_c:
        {
            BleApp_AttributeWritten(deviceId,
                                                   pServerEvent->eventData.attributeWrittenEvent.handle,
                                                   pServerEvent->eventData.attributeWrittenEvent.cValueLength,
                                                   pServerEvent->eventData.attributeWrittenEvent.aValue);
            
