MikroElektronika/HEXIWEAR/SW/KW40/HEXIWEAR_bluetooth/common/app.c
        }
        break;
        
        case gEvtAttributeWrittenWithoutResponse_c:
        {
            BleApp_AttributeWrittenWithoutResponse (deviceId,
                                                    pServerEvent->eventData.attributeWrittenEvent.handle,
                                                    pServerEvent->eventData.attributeWrittenEvent.cValueLength,
                                                    pServerEvent->eventData.attributeWrittenEvent.aValue);
        }
        break;
        
        case gEvtHandleValueConfirmation_c:
        {
            BleApp_HandleValueConfirmation (deviceId);
        }
        break;
        
    default:
        break;
        
    }
}

static void BleApp_CccdWritten (deviceId_t deviceId, uint16_t handle, gattCccdFlags_t cccd)
{
    otapCommand_t otapCommand;
    bleResult_t   bleResult;
    
    /*! Check if the OTAP control point CCCD was written. */
    if (
         (handle == cccd_otap_control_point) &&
         (deviceState != deviceState_watch)
        )
    {
        /*! If the state is Idle try to send a New Image Info Request Command to the OTAP Server. */
        otapCommand.cmdId = gOtapCmdIdNewImageInfoRequest_c;
        FLib_MemCpy (otapCommand.cmd.newImgInfoReq.currentImageId,
                     (uint8_t*)imageIdAll,
                     gOtap_ImageIdFieldSize_c);
        FLib_MemCpy (otapCommand.cmd.newImgInfoReq.currentImageVersion,
                     (uint8_t*)otapClientData.currentImgVer,
                     gOtap_ImageVersionFieldSize_c);
        
        bleResult = OtapCS_SendCommandToOtapServer (service_otap,
                                                    (void*)(&otapCommand),
                                                    cmdIdToCmdLengthTable[gOtapCmdIdNewImageInfoRequest_c]);
        if (gBleSuccess_c == bleResult)
        {
            otapClientData.lastCmdSentToOtapServer = gOtapCmdIdNewImageInfoRequest_c;
            otapClientData.serverWrittenCccd = TRUE;
        }
        else
        {
            /*! A BLE error has occured - Disconnect */
            Gap_Disconnect (deviceId);
            OtapClient_Fail();
            ResetMCU();
        }
    }
}

/*! *********************************************************************************
* \brief        
*
* \param[in]    
* \param[in]    
********************************************************************************** */
static void BleApp_AttributeWritten(deviceId_t deviceId, uint16_t handle, uint16_t length, uint8_t* pValue)
{
    bleResult_t bleResult;
    otapCommand_t otapCommand;
    
    
   if(
      (handle == value_alertIn) &&
      (deviceState == deviceState_watch)
    )
    {
        if(length == gBleCustom_AlertInLength_d)
        {
            osaStatus_t eventWaitStatus;
            uint8_t     attWriteStatus;
            event_flags_t setFlags;
            
            Als_HandleInAlert(pValue);
            
        #if gHostInterface_RxConfirmationEnable //..........................................
            HostInterface_EventConfirmAttPacketClear();
            
            eventWaitStatus = HostInterface_EventConfirmAttPacketWait();
            
            if(eventWaitStatus != osaStatus_Success)
            {
                attWriteStatus = gAttErrCodeUnlikelyError_c;
            }
            else
        #endif //...........................................................................                
            {
                attWriteStatus = gAttErrCodeNoError_c;
            }
            
            GattServer_SendAttributeWrittenStatus(deviceId, handle, attWriteStatus);
        }
    }
    else if(
             (handle == value_otap_control_point) &&
             (deviceState != deviceState_watch)
           )
    {
        /*! Handle all OTAP Server to Client Commands Here. */
        switch(((otapCommand_t*)pValue)->cmdId)
        {
        case gOtapCmdIdNewImageNotification_c:
            bleResult = GattServer_SendAttributeWrittenStatus (deviceId,
                                                               value_otap_control_point,
                                                               gAttErrCodeNoError_c);
            if (gBleSuccess_c == bleResult)
            {
                OtapClient_HandleNewImageNotification (deviceId,
                                                       length,
                                                       pValue);
            }
            else
            {
                /*! A BLE error has occurred - Disconnect */
                Gap_Disconnect (deviceId);
                OtapClient_Fail();
                ResetMCU();
            }
            break;
        case gOtapCmdIdNewImageInfoResponse_c:
            bleResult = GattServer_SendAttributeWrittenStatus (deviceId,
                                                               value_otap_control_point,
                                                               gAttErrCodeNoError_c);
            if (gBleSuccess_c == bleResult)
            {
                OtapClient_HandleNewImageInfoResponse (deviceId,
                                                       length,
                                                       pValue);
            }
            else
            {
                /*! A BLE error has occurred - Disconnect */
                Gap_Disconnect (deviceId);
                OtapClient_Fail();
                ResetMCU();
            }
            break;
        case gOtapCmdIdErrorNotification_c:
            bleResult = GattServer_SendAttributeWrittenStatus (deviceId,
                                                               value_otap_control_point,
                                                               gAttErrCodeNoError_c);
            if (gBleSuccess_c == bleResult)
            {
                OtapClient_HandleErrorNotification (deviceId,
                                                    length,
                                                    pValue);
            }
            else
            {
                /*! A BLE error has occurred - Disconnect */
                Gap_Disconnect (deviceId);
                OtapClient_Fail();
                ResetMCU();
            }
            break;
            
        default:
            otapCommand.cmdId = gOtapCmdIdErrorNotification_c;
            otapCommand.cmd.errNotif.cmdId = pValue[0];
            otapCommand.cmd.errNotif.errStatus = gOtapStatusUnexpectedCommand_c;
    
