MikroElektronika/HEXIWEAR/SW/KW40/HEXIWEAR_bluetooth/common/app.c
            bleResult = OtapCS_SendCommandToOtapServer (service_otap,
                                                        (void*)(&otapCommand),
                                                        cmdIdToCmdLengthTable[gOtapCmdIdErrorNotification_c]);
            if (gBleSuccess_c == bleResult)
            {
                otapClientData.lastCmdSentToOtapServer = gOtapCmdIdErrorNotification_c;
            }
            else
            {
                /*! A BLE error has occurred - Disconnect */
                Gap_Disconnect (deviceId);
                OtapClient_Fail();
                ResetMCU();
            }
            break;
        };
    }
    else
    {
        /*! A GATT Server is trying to GATT Write an unknown attribute value.
        *  This should not happen. Disconnect the link. */
        Gap_Disconnect (deviceId);
        OtapClient_Fail();
        ResetMCU();
    }
}

/*! *********************************************************************************
* \brief        
*
* \param[in]    
* \param[in]    
********************************************************************************** */
static void BleApp_AttributeWrittenWithoutResponse (deviceId_t deviceId,
                                                    uint16_t handle,
                                                    uint16_t length,
                                                    uint8_t* pValue)
{
    otapCommand_t otapCommand;
    otapStatus_t otapStatus = gOtapStatusSuccess_c;
    bleResult_t bleResult;
    
    /* Only the OTAP Data attribute is expected to be written using the
     * ATT Write Without Response Command. */
    if (
        (handle == value_otap_data) &&
        (deviceState != deviceState_watch)
       )
    {
        if (otapClientData.state == mOtapClientStateDownloadingImage_c)
        {
            if (otapClientData.transferMethod == gOtapTransferMethodAtt_c)
            {
                if (((otapCommand_t*)pValue)->cmdId == gOtapCmdIdImageChunk_c)
                {
                    OtapClient_HandleDataChunk (deviceId,
                                                length,
                                                pValue);
                }
                else
                {
                    /* If the OTAP Client received an unexpected command on the data channel send an error to the OTAP Server. */
                    otapStatus = gOtapStatusUnexpectedCmdOnDataChannel_c;
                }
            }
            else
            {
                /* If the OTAP Client is not expecting image file chunks via ATT send an error to the OTAP Server. */
                otapStatus = gOtapStatusUnexpectedTransferMethod_c;
            }
        }
        else
        {
            /* If the OTAP Client is not expecting image file chunks send an error to the OTAP Server. */
            otapStatus = gOtapStatusImageDataNotExpected_c;
        }
        
        if (otapStatus != gOtapStatusSuccess_c)
        {
            otapCommand.cmdId = gOtapCmdIdErrorNotification_c;
            otapCommand.cmd.errNotif.cmdId = pValue[0];
            otapCommand.cmd.errNotif.errStatus = otapStatus;
    
            bleResult = OtapCS_SendCommandToOtapServer (service_otap,
                                                        (void*)(&otapCommand),
                                                        cmdIdToCmdLengthTable[gOtapCmdIdErrorNotification_c]);
            if (gBleSuccess_c == bleResult)
            {
                otapClientData.lastCmdSentToOtapServer = gOtapCmdIdErrorNotification_c;
            }
            else
            {
                /*! A BLE error has occurred - Disconnect */
                Gap_Disconnect (deviceId);
                OtapClient_Fail();
                ResetMCU();                
            }
        }
    }
}

/*! *********************************************************************************
* \brief        
*
* \param[in]    
* \param[in]    
********************************************************************************** */
static void BleApp_HandleValueConfirmation (deviceId_t deviceId)
{
    otapCommand_t otapCommand;
    bleResult_t   bleResult;
    
    /*! Check for which command sent to the OTAP Server the confirmation has been received. */
    if(deviceState != deviceState_watch)
    {
        switch (otapClientData.lastCmdSentToOtapServer)
        {
            case gOtapCmdIdNewImageInfoRequest_c:
                OtapClient_HandleNewImageInfoRequestConfirmation (deviceId);
                break;
                
            case gOtapCmdIdImageBlockRequest_c:
                OtapClient_HandleImageBlockRequestConfirmation (deviceId);
                break;
                
            case gOtapCmdIdImageTransferComplete_c:
                OtapClient_HandleImageTransferCompleteConfirmation (deviceId);
                break;
                
            case gOtapCmdIdErrorNotification_c:
                OtapClient_HandleErrorNotificationConfirmation (deviceId);
                break;
                
            case gOtapCmdIdStopImageTransfer_c:
                OtapClient_HandleStopImageTransferConfirmation (deviceId);
                break;
                
            default:
                otapCommand.cmdId = gOtapCmdIdErrorNotification_c;
                otapCommand.cmd.errNotif.cmdId = gOtapCmdIdNoCommand_c;
                otapCommand.cmd.errNotif.errStatus = gOtapStatusUnexpectedCommand_c;

                bleResult = OtapCS_SendCommandToOtapServer (service_otap,
                                                            (void*)(&otapCommand),
                                                            cmdIdToCmdLengthTable[gOtapCmdIdErrorNotification_c]);
                if (gBleSuccess_c == bleResult)
                {
                    otapClientData.lastCmdSentToOtapServer = gOtapCmdIdErrorNotification_c;
                }
                else
                {
                    /*! A BLE error has occurred - Disconnect */
                    Gap_Disconnect (deviceId);
                    OtapClient_Fail();
                    ResetMCU();
                    
