MikroElektronika/HEXIWEAR/SW/KW40/HEXIWEAR_bluetooth/common/app.c
    if (imgFileHeader->headerLength != sizeof(bleOtaImageFileHeader_t))
    {
        return gOtapStatusUnexpectedHeaderLength_c;
    }
    
    if (imgFileHeader->fieldControl != gBleOtaFileHeaderDefaultFieldControl_c)
    {
        return gOtapStatusUnexpectedHeaderFieldControl_c;
    }
    
    if (imgFileHeader->companyId != gBleOtaCompanyIdentifier_c)
    {
        return gOtapStatusUnknownCompanyId_c;
    }
    
    if (FALSE == FLib_MemCmp (imgFileHeader->imageId, otapClientData.imgId, sizeof(imgFileHeader->imageId)))
    {
        return gOtapStatusUnexpectedImageId_c;
    }
    
    if (FALSE == FLib_MemCmp (imgFileHeader->imageVersion, otapClientData.imgVer, sizeof(imgFileHeader->imageVersion)))
    {
        return gOtapStatusUnexpectedImageVersion_c;
    }
    
    if (imgFileHeader->totalImageFileSize != otapClientData.imgSize)
    {
        return gOtapStatusUnexpectedImageFileSize_c;
    }
    
    return gOtapStatusSuccess_c;
}

/*! *********************************************************************************
* \brief        Set corresponding params when image successfully loaded.
*
********************************************************************************** */

static void OtapClient_Complete(void)
{
    uint8_t *imgVer;
        
    if(deviceState == deviceState_otapStartedMK64)
    {
        imgVer = gHardwareParameters.imageVersionMK64;
    }
    else
    {
        imgVer = gHardwareParameters.imageVersionKW40;
        OTA_SetNewImageFlag ();
    }
    
    // Get device parameters from FLASH.
    NV_ReadHWParameters(&gHardwareParameters);
    
    // Write image version to hw params.
    FLib_MemCpy (imgVer, (uint8_t*)otapClientData.imgVer, gOtap_ImageVersionFieldSize_c);
    
    // Write device state to hw params.
    gHardwareParameters.deviceState = (uint8_t) deviceState_otapCompleted;
    
    NV_WriteHWParameters(&gHardwareParameters);
    OSA_TimeDelay(100u);
}
        
/*! *********************************************************************************
* \brief        Set corresponding params when image loading fail.
*
********************************************************************************** */

static void OtapClient_Fail(void)
{
    //gHardwareParameters.deviceState = (uint8_t) deviceState_otapFailed;
    //NV_WriteHWParameters(&gHardwareParameters);
}

/*! *********************************************************************************
* \brief        Handles measurement timer callback.
*
* \param[in]    pParam        Calback parameters.
********************************************************************************** */
static void TimerMeasurementCallback(void * pParam)
{
    uint32_t hr = 0;
    RNG_GetRandomNo(&hr);
    ;
}

/*! *********************************************************************************
* @}
********************************************************************************** */

void NMI_Handler(void)
{
    asm ("nop");
    ResetMCU();
}

void DefaultISR(void)
{
    ResetMCU();
}

void HardFault_Handler(void)
{
    ResetMCU();
}

/*! *********************************************************************************
* \brief        
*
********************************************************************************** */
static void BleApp_LowPowerEnterCallback(void)
{
    ;
}

/////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////
// Power management functions

/*! *********************************************************************************
* \brief        
*
********************************************************************************** */

static void BleApp_GoToSleepTimerCallback (void *pParam)
{
#if (cPWR_UsePowerDownMode)
    if(deviceState == deviceState_watch)
    {
        PWR_AllowDeviceToSleep();
    }
#endif
}

/*! *********************************************************************************
* \brief        
*
********************************************************************************** */

void BleApp_LowPowerExitCallback(void)
{
#if (cPWR_UsePowerDownMode)

    OSA_EnterCritical(kCriticalDisableInt);
    
    PORT_HAL_SetMuxMode(PORTB,0u,kPortMuxAsGpio);
    PORT_HAL_SetMuxMode(PORTB,18u,kPortMuxAsGpio);
    
    if(PWRLib_MCU_WakeupReason.Bits.FromKeyBoard)
    {
        PWR_DisallowDeviceToSleep();
        
        /* Start timer */
        TMR_StartLowPowerTimer(goToSleepTimerId, gTmrLowPowerSingleShotMillisTimer_c,
                 TmrMilliseconds(20), BleApp_GoToSleepTimerCallback, NULL);
    }
    else
    {
        PORT_HAL_SetPinIntMode(PORTB,0u,kPortIntEitherEdge);
    }
    
    OSA_ExitCritical(kCriticalDisableInt);

#endif    
}

/*! *********************************************************************************
* \brief        
*
********************************************************************************** */

void PORTB_PORTC_IRQHandler(void)
{
#if (cPWR_UsePowerDownMode)
    
    OSA_EnterCritical(kCriticalDisableInt);
    
    if(GPIO_DRV_IsPinIntPending(kGpioHostWakeup) != 0)
    {
        PWR_DisallowDeviceToSleep();
        
        /* Start timer */
        TMR_StartLowPowerTimer(goToSleepTimerId, gTmrLowPowerSingleShotMillisTimer_c,
                 TmrMilliseconds(20), BleApp_GoToSleepTimerCallback, NULL);
        
        GPIO_DRV_ClearPinIntFlag(kGpioHostWakeup);
    }
    
    if(GPIO_DRV_IsPinIntPending(kGpioHostInt) != 0)
    {
        if(GPIO_DRV_ReadPinInput(kGpioHostInt) != 0)
        {
            sleepFalg = false;
            bleApp_intPin.config.interrupt = kPortIntLogicZero;
            GPIO_DRV_InputPinInit(&bleApp_intPin);
            PWR_DisallowDeviceToSleep();
        }
        else
        {
            sleepFalg = true;
            bleApp_intPin.config.interrupt = kPortIntLogicOne;
            GPIO_DRV_InputPinInit(&bleApp_intPin);
            while(PWR_CheckIfDeviceCanGoToSleep() == false)
            {
                PWR_AllowDeviceToSleep();
            }
        }

        GPIO_DRV_ClearPinIntFlag(kGpioHostInt);
    }
    
    OSA_ExitCritical(kCriticalDisableInt);
    
#endif
}

/*! *********************************************************************************
* \brief        
*
********************************************************************************** */
bool_t BleApp_GetSleepFlag(void)
{
    return sleepFalg;
}

/*! *********************************************************************************
* \brief        
*
********************************************************************************** */